# 연습: DataFrame 1

In [5]:
#판다스를 가져오기
import pandas as pd

### 예제 1 
1. Nan이 아닌 부분을 출력하시오.
2. NaN의 값을 0으로 바꾼후 출력하시오.

In [136]:
data = {'Ohio': 35000,
         'Texas': 71000,
         'Oregon': 16000,
         'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas'] #california is not in sdata
obj4 = pd.Series(sdata, index=states)

In [35]:
# 예제 1.1
print(obj4.dropna())

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [ ]:
# 예제 1.2
print(obj4.fillna(0))

### 예제 2

index가 'four'인 행의 값을 [1999, 'Ohio', 3.2, 0]으로 변경하시오.

`columns=['year', 'state', 'pop', 'debt']`

In [69]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
# data?
frame

      year state  pop debt
one    NaN   NaN  NaN  NaN
two    NaN   NaN  NaN  NaN
three  NaN   NaN  NaN  NaN
four   NaN   NaN  NaN  NaN
five   NaN   NaN  NaN  NaN

In [71]:
# 예제 2
frame.loc['four'] = [1999, 'Ohio', 3.2, 0]
frame

       year state  pop debt
one     NaN   NaN  NaN  NaN
two     NaN   NaN  NaN  NaN
three   NaN   NaN  NaN  NaN
four   1999  Ohio  3.2    0
five    NaN   NaN  NaN  NaN

### 예제 3
위 frame에서 index가 two, column이 state 인 값을 'Nevada'로 변경하시오.

In [73]:
# 예제 3
frame.loc['two', 'state'] = 'Nevada'
frame

       year   state  pop debt
one     NaN     NaN  NaN  NaN
two     NaN  Nevada  NaN  NaN
three   NaN     NaN  NaN  NaN
four   1999    Ohio  3.2    0
five    NaN     NaN  NaN  NaN

### 예제 4 
위 frame에 year=2002이고 state='Ohio' 일때 True를 갖는 etc 컬럼을 생성하시오.

In [77]:
frame['etc'] = (frame['year'] == 2002) & (frame['state'] == 'Ohio') #불값을 갖는 컬럼 추가

       year   state  pop debt    etc
one     NaN     NaN  NaN  NaN  False
two     NaN  Nevada  NaN  NaN  False
three   NaN     NaN  NaN  NaN  False
four   1999    Ohio  3.2    0  False
five    NaN     NaN  NaN  NaN  False

### 예제 5 
1. 위 frame에서 one, three, four 행에서 year, state, etc 열만 가져와 frame2에 저장하시오.
2. 수정된 frame2에서 year > 2000, state == Ohio 인 행을 출력 하시오.

In [83]:
# 예제 5.1
frame2 = frame.loc[['one', 'three', 'four'], ['year', 'state', 'etc']]
frame2

       year state    etc
one     NaN   NaN  False
three   NaN   NaN  False
four   1999  Ohio  False

In [85]:
# 예제 5.2
print(frame2[(frame2['year'] > 2000) & (frame2['state'] == 'Ohio')]) #존재하지 않음

Empty DataFrame
Columns: [year, state, etc]
Index: []

### 예제 6 
데이터 프레임의 각 행과 열의 합을 각각 계산하여 출력하시오.

In [93]:
import numpy as np
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), #bde 열을 생성
                  index=['Utah', 'Ohio', 'Texas', 'Oregon']) #Utah, Ohio, Texas, Oregon 행을 생성
frame

               b         d         e
Utah    0.811093 -0.571418  0.926878
Ohio    1.427540  2.178804 -1.303037
Texas  -1.515578 -1.148985 -0.918190
Oregon  0.306158 -0.956549 -0.239881

In [168]:
# 예제 6
print(frame.sum(axis=0)) #열의합
print(frame.sum(axis=1)) #행의합

b    1.029212
d   -0.498148
e   -1.534230
dtype: float64
Utah      1.166553
Ohio      2.303306
Texas    -3.582753
Oregon   -0.890273
dtype: float64

### 예제 7
아래 int_frame을 index, column기준으로 정렬하시오. (단, index, column 모두 정렬되어야 함)<br>

In [103]:
int_frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'b', 'c', 'a']) #column 기준 정렬

In [105]:
# 예제 7
print(int_frame.sort_index(axis=0).sort_index(axis=1))

       a  b  c  d
one    7  5  6  4
three  3  1  2  0

### 예제 8
코스피와 IBM 가격정보를 불러와 상관관계를 파악하시오.
- 코스피 = '^KS11'
- IBM = 'IBM'
- 애플 = 'APLE'

# 주가 데이터를 불러올 티커 목록
tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']  # AAPL: 애플, GOOGL: 구글, MSFT: 마이크로소프트, TSLA: 테슬라

In [160]:
#!pip install pandas_datareader
!pip install yfinance

Requirement already satisfied: yfinance in c:\users\user\anaconda3\lib\site-packages (0.2.46)
Requirement already satisfied: pandas>=1.3.0 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (2.2.2)
Requirement already satisfied: numpy>=1.16.5 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (1.26.4)
Requirement already satisfied: requests>=2.31 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (2.32.2)
Requirement already satisfied: multitasking>=0.0.7 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (0.0.11)
Requirement already satisfied: lxml>=4.9.1 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (5.2.1)
Requirement already satisfied: platformdirs>=2.0.0 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (3.10.0)
Requirement already satisfied: pytz>=2022.5 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (2024.1)
Requirement already satisfied: frozendict>=2.3.4 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (2.4.2)
Requirement already satisfied: peewee>=3.16.2 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (3.17.7)
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (4.12.3)
Requirement already satisfied: html5lib>=1.1 in c:\users\user\anaconda3\lib\site-packages (from yfinance) (1.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\user\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.5)
Requirement already satisfied: six>=1.9 in c:\users\user\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in c:\users\user\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2024.8.30)

In [194]:
# 예제 8
# from pandas_datareader import data as web
# all_data = {}
# for ticker in ['^KS11', 'IBM']:
#     all_data[ticker] = web.get_data_yahoo(ticker)

# price = DataFrame({tic: data['Adj Close']
#                    for tic, data in all_data.items()})

import yfinance as yf
import pandas as pd

# 불러올 티커 목록 (코스피, IBM, 애플 등)
tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']
all_data = {}

# Yahoo Finance 데이터를 가져옴
for ticker in tickers:
    all_data[ticker] = yf.download(ticker)['Adj Close'] #종가를 기준으로

df = pd.concat(all_data, axis=1) # 각 티커의 주가 데이터를 병합하여 하나의 데이터프레임으로 생성
df.tail()

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

,^KS11,IBM,AAPL,GOOGL,MSFT,TSLA
Ticker,^KS11,IBM,AAPL,GOOGL,MSFT,TSLA
Date,,,,,,
2024-10-17 00:00:00+00:00,2609.300049,232.880005,232.149994,162.929993,416.720001,220.889999
2024-10-18 00:00:00+00:00,2593.820068,232.199997,235.000000,163.419998,418.160004,220.699997
2024-10-21 00:00:00+00:00,2604.919922,231.750000,236.479996,164.070007,418.779999,218.850006
2024-10-22 00:00:00+00:00,2570.699951,232.250000,235.860001,165.139999,427.510010,217.970001
2024-10-23 00:00:00+00:00,2599.620117,NaN,NaN,NaN,NaN,NaN

In [196]:
import yfinance as yf
import pandas as pd

# 불러올 티커 목록 (코스피, IBM, 애플 등)
tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']

# yfinance를 사용해 데이터 다운로드
data = yf.download(tickers)['Adj Close']

# 주가 데이터 출력
data.tail()

[*********************100%***********************]  6 of 6 completed

Ticker,AAPL,GOOGL,IBM,MSFT,TSLA,^KS11
Date,,,,,,
2024-10-17 00:00:00+00:00,232.149994,162.929993,232.880005,416.720001,220.889999,2609.300049
2024-10-18 00:00:00+00:00,235.000000,163.419998,232.199997,418.160004,220.699997,2593.820068
2024-10-21 00:00:00+00:00,236.479996,164.070007,231.750000,418.779999,218.850006,2604.919922
2024-10-22 00:00:00+00:00,235.860001,165.139999,232.250000,427.510010,217.970001,2570.699951
2024-10-23 00:00:00+00:00,NaN,NaN,NaN,NaN,NaN,2599.620117

In [170]:

print(df.corr().loc['^KS11', 'IBM']) #IBM과 KOSPI간의 상관관게 출력 #0.852548출력

Ticker       IBM
Ticker
^KS11   0.852548

### 예제 9
1. 2~3행에서 '0'컬럼을 None으로 변경 하시오.
2. 0~2행에서 '2'컬럼을 None으로 변경하시오.
3. 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

In [190]:
# 예제 9.1 2~3행에서 '0'컬럼을 None으로 변경 하시오.
df.iloc[1:3, 0] = None
df

,^KS11,IBM,AAPL,GOOGL,MSFT,TSLA
Ticker,^KS11,IBM,AAPL,GOOGL,MSFT,TSLA
Date,,,,,,
1962-01-02 00:00:00+00:00,NaN,1.513320,NaN,NaN,NaN,NaN
1962-01-03 00:00:00+00:00,NaN,1.526550,NaN,NaN,NaN,NaN
1962-01-04 00:00:00+00:00,NaN,1.511337,NaN,NaN,NaN,NaN
1962-01-05 00:00:00+00:00,NaN,1.481573,NaN,NaN,NaN,NaN
1962-01-08 00:00:00+00:00,NaN,1.453793,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
2024-10-17 00:00:00+00:00,2609.300049,232.880005,232.149994,162.929993,416.720001,220.889999
2024-10-18 00:00:00+00:00,2593.820068,232.199997,235.000000,163.419998,418.160004,220.699997
2024-10-21 00:00:00+00:00,2604.919922,231.750000,236.479996,164.070007,418.779999,218.850006
2024-10-22 00:00:00+00:00,2570.699951,232.250000,235.860001,165.139999,427.510010,217.970001
2024-10-23 00:00:00+00:00,2599.620117,NaN,NaN,NaN,NaN,NaN

In [180]:
# 예제 9.2 0~2행에서 '2'컬럼을 None으로 변경하시오.
df.iloc[0:3, 2] = None
df

,^KS11,IBM,AAPL,GOOGL,MSFT,TSLA
Ticker,^KS11,IBM,AAPL,GOOGL,MSFT,TSLA
Date,,,,,,
1962-01-02 00:00:00+00:00,NaN,1.513320,NaN,NaN,NaN,NaN
1962-01-03 00:00:00+00:00,NaN,1.526550,NaN,NaN,NaN,NaN
1962-01-04 00:00:00+00:00,NaN,1.511337,NaN,NaN,NaN,NaN
1962-01-05 00:00:00+00:00,NaN,1.481573,NaN,NaN,NaN,NaN
1962-01-08 00:00:00+00:00,NaN,1.453793,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
2024-10-17 00:00:00+00:00,2609.300049,232.880005,232.149994,162.929993,416.720001,220.889999
2024-10-18 00:00:00+00:00,2593.820068,232.199997,235.000000,163.419998,418.160004,220.699997
2024-10-21 00:00:00+00:00,2604.919922,231.750000,236.479996,164.070007,418.779999,218.850006
2024-10-22 00:00:00+00:00,2570.699951,232.250000,235.860001,165.139999,427.510010,217.970001
2024-10-23 00:00:00+00:00,2599.620117,NaN,NaN,NaN,NaN,NaN

In [ ]:
# 예제 9.3 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

### 예제 10
1. multi_idx 이름으로 0 ~ 20의 값을 갖는 (5,4) 데이터 프레임을 생성하시오.
  - index 상위 색인: a, a, b, b, c
  - index 하위 색인: 1,2, 1, 2, 1
  - columns 상위 색인: 'KOR', 'KOR', 'USA', 'USA'
  - columns 하위 색인: 'Seoul', 'Busan', 'LA', 'NewYork'
2. index=b, column= KOR의 Seoul에 해당하는 값을 출력하시오.

In [ ]:
# 예제 10.1

In [ ]:
# 예제 10.2

### 예제 11
1. 위 데이터프레임에 index(key1, key2), column(Country, Region)의 이름을 설정하시오.
2. 2번째 index로 데이터 프레임을 정렬 하시오.
3. column의 레벨을 바꾸시오.

In [ ]:
# 예제 11.1

In [ ]:
# 예제 11.2

In [ ]:
# 예제 11.3

---

In [ ]:
# end of file